{
  "metadata": {
    "total_parameters": 9268626928,
    "total_size": 18537253856
  },
  "weight_map": {
    "model.region.coord_decoder.bias": "modelv2-00004-of-00004.safetensors",
    "model.region.coord_decoder.weight": "modelv2-00004-of-00004.safetensors",
    "model.region.coord_encoder.bias": "modelv2-00004-of-00004.safetensors",
    "model.region.coord_encoder.weight": "modelv2-00004-of-00004.safetensors",
    "model.region.coord_features": "modelv2-00004-of-00004.safetensors",
    "model.region.ln.bias": "modelv2-00004-of-00004.safetensors",
    "model.region.ln.weight": "modelv2-00004-of-00004.safetensors",
    "model.region.size_decoder.bias": "modelv2-00004-of-00004.safetensors",
    "model.region.size_decoder.weight": "modelv2-00004-of-00004.safetensors",
    "model.region.size_encoder.bias": "modelv2-00004-of-00004.safetensors",
    "model.region.size_encoder.weight": "modelv2-00004-of-00004.safetensors",
    "model.region.size_features": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.0.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.attn.tau.alpha": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.attn.tau.wq": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.attn.tau.wv": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.ln.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.ln.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.0.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.attn.tau.alpha": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.attn.tau.wq": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.attn.tau.wv": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.ln.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.ln.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.1.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.10.attn.proj.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.attn.proj.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.attn.qkv.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.attn.qkv.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.attn.tau.alpha": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.attn.tau.wq": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.attn.tau.wv": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.ln.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.ln.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.mlp.fc1.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.mlp.fc2.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.mlp.router.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.10.mlp.router.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.attn.proj.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.attn.proj.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.attn.qkv.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.attn.qkv.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.attn.tau.alpha": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.attn.tau.wq": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.attn.tau.wv": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.ln.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.ln.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.mlp.fc1.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.mlp.fc2.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.mlp.router.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.11.mlp.router.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.attn.proj.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.attn.proj.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.attn.qkv.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.attn.qkv.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.attn.tau.alpha": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.attn.tau.wq": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.attn.tau.wv": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.ln.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.ln.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.mlp.fc1.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.mlp.fc2.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.mlp.router.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.12.mlp.router.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.attn.proj.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.attn.proj.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.attn.qkv.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.attn.qkv.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.attn.tau.alpha": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.attn.tau.wq": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.attn.tau.wv": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.ln.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.ln.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.mlp.fc1.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.mlp.fc2.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.13.mlp.router.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.13.mlp.router.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.14.attn.proj.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.attn.proj.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.attn.qkv.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.attn.qkv.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.attn.tau.alpha": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.attn.tau.wq": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.attn.tau.wv": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.ln.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.ln.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.mlp.fc1.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.mlp.fc2.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.mlp.router.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.14.mlp.router.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.attn.proj.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.attn.proj.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.attn.qkv.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.attn.qkv.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.attn.tau.alpha": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.attn.tau.wq": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.attn.tau.wv": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.ln.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.ln.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.mlp.fc1.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.mlp.fc2.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.mlp.router.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.15.mlp.router.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.attn.proj.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.attn.proj.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.attn.qkv.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.attn.qkv.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.attn.tau.alpha": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.attn.tau.wq": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.attn.tau.wv": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.ln.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.ln.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.mlp.fc1.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.mlp.fc2.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.mlp.router.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.16.mlp.router.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.attn.proj.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.attn.proj.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.attn.qkv.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.attn.qkv.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.attn.tau.alpha": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.attn.tau.wq": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.attn.tau.wv": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.ln.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.ln.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.mlp.fc1.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.mlp.fc2.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.mlp.router.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.17.mlp.router.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.attn.proj.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.attn.proj.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.attn.qkv.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.attn.qkv.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.attn.tau.alpha": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.attn.tau.wq": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.attn.tau.wv": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.ln.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.ln.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.mlp.fc1.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.mlp.fc2.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.mlp.router.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.18.mlp.router.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.attn.proj.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.attn.proj.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.attn.qkv.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.attn.qkv.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.attn.tau.alpha": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.attn.tau.wq": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.attn.tau.wv": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.ln.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.ln.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.mlp.fc1.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.19.mlp.fc2.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.19.mlp.router.bias": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.19.mlp.router.weight": "modelv2-00003-of-00004.safetensors",
    "model.text.blocks.2.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.attn.tau.alpha": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.attn.tau.wq": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.attn.tau.wv": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.ln.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.ln.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.2.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.20.attn.proj.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.attn.proj.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.attn.qkv.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.attn.qkv.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.attn.tau.alpha": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.attn.tau.wq": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.attn.tau.wv": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.ln.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.ln.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.mlp.fc1.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.mlp.fc2.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.mlp.router.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.20.mlp.router.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.attn.proj.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.attn.proj.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.attn.qkv.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.attn.qkv.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.attn.tau.alpha": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.attn.tau.wq": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.attn.tau.wv": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.ln.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.ln.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.mlp.fc1.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.mlp.fc2.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.mlp.router.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.21.mlp.router.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.attn.proj.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.attn.proj.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.attn.qkv.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.attn.qkv.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.attn.tau.alpha": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.attn.tau.wq": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.attn.tau.wv": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.ln.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.ln.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.mlp.fc1.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.mlp.fc2.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.mlp.router.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.22.mlp.router.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.attn.proj.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.attn.proj.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.attn.qkv.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.attn.qkv.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.attn.tau.alpha": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.attn.tau.wq": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.attn.tau.wv": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.ln.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.ln.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.mlp.fc1.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.mlp.fc2.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.mlp.router.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.23.mlp.router.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.blocks.3.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.attn.tau.alpha": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.attn.tau.wq": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.attn.tau.wv": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.ln.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.ln.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.3.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.attn.tau.alpha": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.attn.tau.wq": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.attn.tau.wv": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.ln.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.ln.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.mlp.router.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.4.mlp.router.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.attn.tau.alpha": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.attn.tau.wq": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.attn.tau.wv": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.ln.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.ln.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.mlp.router.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.5.mlp.router.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.attn.tau.alpha": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.attn.tau.wq": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.attn.tau.wv": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.ln.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.ln.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.mlp.router.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.6.mlp.router.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.attn.tau.alpha": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.attn.tau.wq": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.attn.tau.wv": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.ln.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.ln.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.mlp.router.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.7.mlp.router.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.attn.tau.alpha": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.attn.tau.wq": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.attn.tau.wv": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.ln.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.ln.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.mlp.fc1.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.8.mlp.fc2.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.8.mlp.router.bias": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.8.mlp.router.weight": "modelv2-00001-of-00004.safetensors",
    "model.text.blocks.9.attn.proj.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.attn.proj.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.attn.qkv.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.attn.qkv.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.attn.tau.alpha": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.attn.tau.wq": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.attn.tau.wv": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.ln.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.ln.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.mlp.fc1.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.mlp.fc2.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.mlp.router.bias": "modelv2-00002-of-00004.safetensors",
    "model.text.blocks.9.mlp.router.weight": "modelv2-00002-of-00004.safetensors",
    "model.text.lm_head.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.lm_head.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.post_ln.bias": "modelv2-00004-of-00004.safetensors",
    "model.text.post_ln.weight": "modelv2-00004-of-00004.safetensors",
    "model.text.wte": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.0.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.1.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.10.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.11.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.12.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.13.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.14.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.15.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.16.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.17.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.18.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.19.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.2.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.20.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.21.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.22.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.23.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.24.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.25.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.26.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.3.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.4.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.5.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.ln1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.ln2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.ln2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.mlp.fc1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.mlp.fc1.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.mlp.fc2.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.6.mlp.fc2.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.7.attn.proj.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.7.attn.proj.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.7.attn.qkv.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.7.attn.qkv.weight": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.7.ln1.bias": "modelv2-00001-of-00004.safetensors",
    "model.vision.blocks.7.ln1.weight": "modelv2-00001-of-00004.safetensors",
